reddit_clone/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
<h3>Comments</h3>
<% @all_comments = @post.comments.includes(:author) %>