reddit_clone/app/models/post.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
---
  def comments_by_parent_id
    comments = self.comments
    # return {} unless comments
    temp = Hash.new { |h,k| h[k] = [] }

    comments.each do |comment|