reddit_clone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "yooo quidditch dogs are delicious"], ["author_id", 2], ["post_id", 2], ["created_at", "2018-09-18 22:05:33.512910"], ["updated_at", "2018-09-18 22:05:33.512910"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:post_id] if params[:post_id]
    @comment.author_id = current_user.id

    if @comment.save