reddit_clone/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 AND "posts"."author_id" = $2 LIMIT $3  [["id", 1], ["author_id", 1], ["LIMIT", 1]]
---
  def edit
    @post = Post.find_by(id: params[:id], author_id: current_user.id)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 AND "posts"."author_id" = $2 LIMIT $3  [["id", 1], ["author_id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["url", "???ppppppp"], ["content", "I DO NOT love this freaking sport"], ["updated_at", "2018-09-18 21:27:39.937701"], ["id", 1]]
---
  def update
    @post = Post.find_by(id: params[:id], author_id: current_user.id)
    unless @post
      flash[:errors] = ['You cannot edit this post']
      logout
      redirect_to new_session_url
    end

    if @post.update(post_params)