reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 AND "subs"."moderator_id" = $2 LIMIT $3  [["id", 1], ["moderator_id", 1], ["LIMIT", 1]]
---
  def edit
    @sub = Sub.find_by(id: params[:id], moderator_id: current_user.id)

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 AND "subs"."moderator_id" = $2 LIMIT $3  [["id", 1], ["moderator_id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "quidditch12345"], ["description", "a fun fun cool game with a snitch?"], ["updated_at", "2018-09-18 21:29:30.342478"], ["id", 1]]
---
  def update
    @sub = Sub.find_by(id: params[:id], moderator_id: current_user.id)
    unless @sub
      flash[:errors] = ["You do not have permission to edit this Sub"]
      logout
      redirect_to new_session_url
    end
    if @sub.update(sub_params)