reddit_clone/app/controllers/votes_controller.rb

  def create
    old_vote = Vote.find_by(
      user_id: current_user.id,
      voteable_id: params[:vote][:voteable_id])
    old_vote.destroy if old_vote

    @vote = Vote.new(vote_params)
    @vote.user_id = current_user.id
    if @vote.save
---
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."voteable_id" = $2 LIMIT $3  [["user_id", 3], ["voteable_id", 6], ["LIMIT", 1]]
DELETE FROM "votes" WHERE "votes"."id" = $1  [["id", 3]]
INSERT INTO "votes" ("upvote", "voteable_type", "voteable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["upvote", true], ["voteable_type", "Comment"], ["voteable_id", 6], ["created_at", "2018-09-19 00:01:21.296281"], ["updated_at", "2018-09-19 00:01:21.296281"], ["user_id", 3]]